/*
SQLyog Ultimate v11.33 (64 bit)
MySQL - 5.7.14 : Database - banggou
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`banggou` /*!40100 DEFAULT CHARACTER SET latin1 */;

USE `banggou`;

/*Table structure for table `goodslist` */

DROP TABLE IF EXISTS `goodslist`;

CREATE TABLE `goodslist` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `bianhao` varchar(50) DEFAULT NULL,
  `goodsname` varchar(100) NOT NULL,
  `pinpai` varchar(200) DEFAULT NULL,
  `price` varchar(50) DEFAULT NULL,
  `yuanjia` varchar(50) DEFAULT NULL,
  `zhekou` varchar(50) DEFAULT NULL,
  `color` varchar(50) DEFAULT NULL,
  `size` varchar(50) DEFAULT NULL,
  `xiaoliang` varchar(50) DEFAULT NULL,
  `jifen` varchar(50) DEFAULT NULL,
  `pingjia` varchar(250) DEFAULT NULL,
  `imgurl` varchar(250) DEFAULT NULL,
  `category` varchar(100) DEFAULT NULL,
  `kucun` varchar(100) DEFAULT NULL,
  `createTime` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=62 DEFAULT CHARSET=utf8;

/*Data for the table `goodslist` */

insert  into `goodslist`(`id`,`bianhao`,`goodsname`,`pinpai`,`price`,`yuanjia`,`zhekou`,`color`,`size`,`xiaoliang`,`jifen`,`pingjia`,`imgurl`,`category`,`kucun`,`createTime`) values (2,'A04727','休闲裤男士九分裤原创哈伦宽松','妮分儿','99','199','1.5折','蓝色','M','114','23','12','img/g2.jpg','男装','233','2017-06-10 11:12:09'),(3,'A04727','男款时尚趣味卡通图案印花短袖T恤','THE 2ND LAW','29.9','188','1.5折','白色','M','112','23','12','img/g3.jpg','男装','233','2017-06-10 11:14:31'),(4,'A04727','男款潮流时尚修身字母印花短袖T恤','THE 2ND LAW','29.9','188','1.5折','白色','M','111','23','32','img/g4.jpg','男装','233','2017-06-10 11:15:26'),(5,'A04727','男款潮流趣味图案印花短袖T恤','THE 2ND LAW','29.9','179','1.5折','黑色','M','114','32','2','img/g5.jpg','男装','2323','2017-06-10 11:37:08'),(6,'A04727','男款趣味字母印花卡通短袖T恤','THE 2ND LAW','29.9','188','1.5折','黑色','M','115','32','32','img/g6.jpg','男装','232','2017-06-10 12:10:51'),(7,'A04727','男款极简字母基础印花短袖T恤','THE 2ND LAW','29.9','188','1.5折','白色','M','333','23','32','img/g7.jpg','男装','32','2017-06-10 12:11:45'),(9,'A04727','男款时尚态度个性潮流印花短袖T恤','THE 2ND LAW','29.9','188','1.5折','白色','M','444','23','2','img/g9.jpg','男装','4343','2017-06-10 12:12:40'),(8,'A04727','男款基础修身字母印花短袖T恤','THE 2ND LAW','29.9','199','1.5折','白色','M','55','32','23','img/g8.jpg','男装','4343','2017-06-10 12:12:38'),(10,'A04727','基础纯棉舒适男士休闲圆领短袖印花','米郎骑士','29.9','199','1.5折','白色','M','66','23','32','img/g10.jpg','男装','232','2017-06-10 12:45:53'),(11,'A04727','韩版奥戴尔棉男士休闲圆领短袖印花','米郎骑士','29.9','179','1.5折','蓝色','M','43','23','23','img/g11.jpg','男装','323','2017-06-10 12:47:25'),(12,'A04727','日系文艺男潮T奥戴尔棉圆领短袖T恤','米郎骑士','48','166','1.5折','白色','M','23','32','--','img/g12.jpg','男装','323','2017-06-10 12:54:44'),(13,'A04727','春夏新款四季裤韩版潮品九分牛仔裤','米郎骑士','76','199','1.5折','蓝色','M','342','32','--','img/g13.jpg','女装','123','2017-06-10 12:57:34'),(14,'A04727','欧美时尚前后字母印花百搭圆领短袖','HAODUOYI','20','159','1.5折','白色','S','32','32','--','img/g14.jpg','女装','132','2017-06-10 12:59:45'),(15,'A04727','柏撒防水台扣带侧根罗马舒适休闲女','柏撒','29.9','188','1.5折','黑色','37','324','23','--','img/g15.jpg','女鞋','324','2017-06-10 13:04:33'),(16,'A04727','时尚男友款简洁黑白撞色条纹 宽松休','HAODUOYI','25','179','1.5折','黑色','M','232','23','--','img/g16.jpg','女装','324','2017-06-10 13:09:10'),(17,'A04727','白色男士短袖T恤纯色修身半袖夏季','米宿','29.9','169','1.5折','白色','M','233','34','--','img/g17.jpg','男装','424','2017-06-10 13:11:30'),(18,'A04727','基础纯棉舒适男士休闲圆领短袖印花','米郎骑士','29.9','169','1.5折','灰色','M','323','34','--','img/g18.jpg','男装','4234','2017-06-10 13:14:58'),(19,'A04727','日系文艺男复古竹节棉圆领短袖潮T','米郎骑士','45','189','1.5折','红色','M','232','34','--','img/g19.jpg','男装','4324','2017-06-10 13:18:56'),(20,'A04727','新款男装短袖T恤','THE 2ND LAW','29.9','189','1.5折','蓝色','M','122','32','--','img/g20.jpg','男装','234','2017-06-10 13:20:13'),(21,'A04727','17新品夏装时尚潮男糖果色系绳系运','赛宾保罗','29.9','189','1.5折','白色','40','123','23','--','img/g21.jpg','男鞋','4324','2017-06-10 13:26:31'),(22,'A04727','男装格子休闲短裤','雅胜利','65','189','1.5折','灰色','M','231','23','23','img/g22.jpg','男装','45','2017-06-10 13:29:39'),(23,'A04727','夏季清爽新款短裤韩版潮品五分牛仔','米郎骑士','59','189','1.5折','蓝色','M','23','23','23','img/g23.jpg','男装','454','2017-06-10 13:37:04'),(24,'A04727','基础纯棉舒适男士休闲圆领短袖印花','米郎骑士','29.9','189','1.5折','红色','M','34','43','23','img/g24.jpg','男装','6','2017-06-10 13:38:57'),(25,'A04727','男款时尚趣味卡通图案印花短袖T恤','THE 2ND LAW','29.9','189','1.5折','黑色','M','23','23','34','img/g25.jpg','男装','4','2017-06-10 13:40:37'),(26,'A04727','日系文艺男潮T素色奥戴尔圆领短袖T','米郎骑士','29.9','189','1.5折','墨绿色','M','34','34','34','img/g26.jpg','男装','564','2017-06-10 13:48:51'),(27,'A04727','【夏季新品】男植绒字母印花短袖T','METERSBONWE','69','189','1.5折','白色','M','34','43','34','img/g27.jpg','男装','546','2017-06-10 13:50:37'),(28,'A04727','云水心夏装女装时尚休闲九分裤运动','云水心','59','189','1.5折','白色','M','34','34','324','img/g28.jpg','女装','56','2017-06-10 13:52:17'),(29,'A04727','17新品夏装时尚潮男 纯色系绳系运','赛宾保罗','39.9','189','1.5折','绿色','M','234','23','24','img/g29.jpg','男装','46','2017-06-10 13:54:53'),(30,'A04727','男款潮流趣味图案印花短袖T恤','THE 2ND LAW','29.9','189','1.5折','白色','M','342','32','342','img/g30.jpg','男装','456','2017-06-10 13:55:04'),(31,'A04727','17新品夏装时尚潮男圆领休闲短袖字','赛宾保罗','29.9','189','1.5折','白色','S','23','32','234','img/g31.jpg','男装','46','2017-06-10 13:57:04'),(32,'A04727','17新品夏装时尚潮男 纯色系绳系运','赛宾保罗','39.9','189','1.5折','黄色','M','234','24','34','img/g32.jpg','男装','756','2017-06-10 13:59:55'),(33,'A04727','春夏九分牛仔女式哈伦裤束脚裤','妮分儿','79','189','1.5折','天蓝色','S','24','24','234','img/g33.jpg','女装','657','2017-06-10 14:01:24'),(34,'A04727','男款音乐态度字母印花短袖潮流T恤','THE 2ND LAW','29.9','189','1.5折','白色','M','24','32','342','img/g34.jpg','男装','67','2017-06-10 14:03:19'),(35,'A04727','欧美时尚前后字母印花百搭圆领短袖','HAODUOYI','20','189','1.5折','白色','S','43','23','234','img/g35.jpg','女装','564','2017-06-10 14:05:19'),(36,'A04727','棉麻小清新条纹短袖连衣裙','ANMO','69','189','1.5折','蓝色','S','23','32','2342','img/g36.jpg','女装','546','2017-06-10 14:05:49'),(37,'A04727','春夏新款四季裤韩版潮品九分牛仔裤','米郎骑士','76','189','1.5折','蓝色','S','43','32','324','img/g37.jpg','女装','56','2017-06-10 14:06:49'),(38,'A04727','男鞋夏季潮鞋百搭透气运动鞋休闲鞋','维丹诺','49','189','1.5折','黑色','40','42','23','234','img/g38.jpg','男鞋','456','2017-06-10 14:07:49'),(39,'A04727','柏撒防水台扣带侧根罗马舒适休闲女','柏撒','29.9','189','1.5折','黑色','37','324','3','24','img/g39.jpg','女鞋','456','2017-06-10 14:08:49'),(40,'A04727','欧美时尚字母印花七分袖宽松圆领T','HAODUOYI','19','189','1.5折','白色','S','423','34','23','img/g40.jpg','女装','56','2017-06-10 14:10:49'),(41,'A04727','【夏季新品】女不对称字母T恤','ME&CITY','119','189','1.5折','白色','S','34','23','34','img/g41.jpg','女装','54','2017-06-10 14:11:32'),(42,'A04727','男款时尚运动风格简约字母印花个性','THE 2ND LAW','29.9','189','1.5折','黑色','M','32','23','3','img/g42.jpg','男装','466','2017-06-10 14:12:32'),(43,'A04727','云水心2017韩版刺绣字母宽松BF风','云水心','45','189','1.5折','绿色','S','4233','23','23','img/g43.jpg','女装','546','2017-06-10 14:12:42'),(44,'A04727','男装休闲短裤夏季纯棉薄款七分裤','雅胜利','59','189','1.5折','卡其色','M','234','23','23','img/g44.jpg','男装','4564','2017-06-10 14:12:56'),(45,'A04727','男款基础简约涂鸦印花时尚潮流短袖','THE 2ND LAW','48','189','1.5折','白色','M','24','23','21','img/g45.jpg','男装','564','2017-06-10 14:13:02'),(46,'A04727','男款字母卡通时尚印花潮流短袖T恤','THE 2ND LAW','38','189','1.5折','黑色','M ','234','3','32','img/g46.jpg','男装','54','2017-06-10 14:13:22'),(47,'A04727','文艺小清新中袖连衣裙','ANMO','89','189','1.5折','白色','S','324','23','234','img/g47.jpg','女装','56','2017-06-10 14:13:28'),(48,'A04727','男士纯色一颗扣简约圆领短袖T恤','妮分儿','58','189','1.5折','宝蓝色','M','234','23','324','img/g48.jpg','男装','546','2017-06-10 14:13:32'),(49,'A04727','【夏季新品】男潮流字母图案印花短','METERSBONWE','59','189','1.5折','灰色','M','42','42','32','img/g49.jpg','男装','456','2017-06-10 14:13:39'),(50,'A04727','【夏季新品】男简约基本字母印花短','METERSBONWE','69','189','1.5折','红色','M','24','2','234','img/g50.jpg','男装','546','2017-06-10 14:13:47'),(51,'A04727','男舒适小脚TR面料九分裤','METERSBONWE','79','189','1.5折','灰色','M','234','43','34','img/g51.jpg','男装','5','2017-06-10 14:13:52'),(52,'A04727','男基本五袋牛仔长裤','METERSBONWE','69','189','1.5折','黑色','M','34','34','234','img/g52.jpg','男装','64','2017-06-10 14:13:54'),(53,'A04727','单边露肩纯色修身显瘦T恤女露肩上','HAODUOYI','29.9','189','1.5折','白色','S','324','34','324','img/g53.jpg','女装','64','2017-06-10 14:14:05'),(54,'A04727','爆款推荐麻棉宽松镂空纽扣领口文艺','三寸天堂','49','189','1.5折','墨绿色','S','34','34','324','img/g54.jpg','女装','56','2017-06-10 14:14:15'),(55,'A04727','【夏季新品】女基本款短袖T恤','METERSBONWE','55','189','1.5折','白色','S','34','34','234','img/g55.jpg','女装','67','2017-06-10 14:14:19'),(56,'A04727','男童恐龙图案T恤','MOOMOO','59','189','1.5折','绿色','S','34','34','234','img/g56.jpg','童装男','87','2017-06-10 14:14:20'),(57,'A04727','男童基本款简洁时尚针织恤','MOOMOO','46','189','1.5折','红色','S','34','34','34','img/g57.jpg','童装男','768','2017-06-10 14:14:22'),(58,'A04727','女式时尚短裤','ME&CITY','59','189','1.5折','白色','S','34','43','234','img/g58.jpg','女装','78','2017-06-10 14:14:24'),(59,'A04727','男常年款基本背心','ME&CITY','69','189','1.5折','白色','M','34','34','34','img/g59.jpg','男装','78','2017-06-10 14:14:26'),(60,'A04727','男童多彩休闲T恤','MOOMOO','59','189','1.5折','白色','M','34','34','234','img/g60.jpg','童装男','78','2017-06-10 14:14:32');

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'pk',
  `username` varchar(50) NOT NULL,
  `password` varchar(50) DEFAULT NULL,
  `telephone` varchar(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=62 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`id`,`username`,`password`,`telephone`) values (1,'admin','admin','13411229999');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
